{
  "backend/DirectionType.mo": "Defines a DirectionType variant with up and down values.",
  "backend/main.mo": "Actor managing market data, snapshots, user preferences, and asset filtering with caching logic.",
  "backend/MarketData.mo": "Defines MarketData containing symbol, price, volume, and direction.",
  "backend/Theme.mo": "Defines a Theme variant with darkNeon and cyberGlow options.",
  "backend/UserPreferences.mo": "Defines user preferences including favourites, theme, alerts, language, and input type with principal.",
  "feature_evidence.json": "Lists feature evidence reports mapping features to related frontend files and components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for multiple frontend files and components.",
  "frontend/index.css": "Empty stylesheet placeholder with no content.",
  "frontend/index.html": "PWA‑optimized HTML entry with icons, splash screens, meta tags, and iOS standalone support.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, screenshots, shortcuts, and theme settings.",
  "frontend/public/sw.js": "Service worker v9 handling caching, activation cleanup, and strict fetch rules for offline support.",
  "frontend/src/App.tsx": "Main application component managing tabs, service worker updates, URL sync, online status, and initializing the learning engine.",
  "frontend/src/components/AIPerformancePanel.tsx": "Displays AI learning statistics for an asset or top assets, loading data from the learning engine with compact and full modes.",
  "frontend/src/components/AppErrorBoundary.tsx": "Error boundary component that catches runtime errors, shows diagnostic UI, and clears caches before reloading the app.",
  "frontend/src/components/AssetResearch.tsx": "Asset search and analysis panel fetching Binance data, supporting autocomplete, symbol selection, and predictive insights.",
  "frontend/src/components/DataStatusIndicator.tsx": "Shows real‑time data status including stale data, errors, provider info, and retry option.",
  "frontend/src/components/DynamicAlerts.tsx": "Generates and displays real‑time radar and recommendation alerts with cooldown logic, sensitivity rules, and auto‑dismiss.",
  "frontend/src/components/Footer.tsx": "Renders a footer with a copyright message, heart icon, and link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Displays the app header with branding and a conditional PWA install button and dialog.",
  "frontend/src/components/ICPAnalysis.tsx": "Shows detailed ICP market analysis with loading, error handling, and dynamic styling based on price movement.",
  "frontend/src/components/InstallPrompt.tsx": "Provides a timed install prompt for the PWA with platform‑specific messaging and a dialog trigger.",
  "frontend/src/components/MarketCard.tsx": "Displays a selectable market summary card with price, volume, trend, and confidence indicators.",
  "frontend/src/components/MarketOverview.tsx": "Lists all markets with selectable cards and shows detailed analysis for the selected symbol, including loading and error states.",
  "frontend/src/components/MarketSnapshotDiagnostics.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/Opportunities.tsx": "Displays categorized trading opportunities with loading, error states, freshness info, and tabbed navigation.",
  "frontend/src/components/PredictiveConfidencePanel.tsx": "Displays predictive confidence metrics using gradients, badges, and compact or detailed layouts based on provided analysis data.",
  "frontend/src/components/PWADiagnosticsView.tsx": "UI component that displays PWA diagnostic info such as display mode, install prompt status, and readiness, with refresh support.",
  "frontend/src/components/PWAInstallDialog.tsx": "Installation dialog that guides users through PWA installation steps, with special handling for iOS devices.",
  "frontend/src/components/PWAInstallStatus.tsx": "Shows current PWA installation status, installability, device support, and provides install actions when available.",
  "frontend/src/components/RadarDashboard.tsx": "Main radar dashboard handling market data, anomaly alerts, filters, learning signals, and new alert detection with extensive UI controls.",
  "frontend/src/components/ResetFromScratchDialog.tsx": "Confirmation dialog that resets all local app data and reloads the app, showing status and handling errors.",
  "frontend/src/components/TabFetchErrorState.tsx": "Displays a styled error state with optional error details and reload handling, including special messaging for interface mismatch issues.",
  "frontend/src/components/TabPageCard.tsx": "Renders a themed card layout for tab pages with optional icon, badge, and content slot.",
  "frontend/src/components/ThemeProvider.tsx": "Provides theme context for switching between darkNeon and cyberGlow themes with persistence in localStorage.",
  "frontend/src/components/TopRecommendations.tsx": "Fetches market and recommendation data, displaying loading, error, or a scrollable list of enriched top recommendations.",
  "frontend/src/components/UserPreferences.tsx": "Manages user settings like theme, favorites, alerts, and learning priorities with UI controls and persistent storage.",
  "frontend/src/hooks/queries/analysisEnrichment.ts": "Computes advanced technical analysis with confidence scoring, learning engine integration, and detection of zones and institutional orders.",
  "frontend/src/hooks/queries/binanceFetch.ts": "Provides functions to fetch Binance market data and specific assets with error handling plus a filter for major trading pairs.",
  "frontend/src/hooks/queries/binanceFuturesMetrics.ts": "Provides funding rate and open interest fetchers for Binance Futures with partial-failure handling and in‑memory history tracking.",
  "frontend/src/hooks/queries/learningIntegration.ts": "Integrates market data with a learning engine to record and update prediction results, optionally prioritizing favourite symbols.",
  "frontend/src/hooks/queries/localSignals.ts": "Generates recommendations and detects anomalies like volatility, funding irregularities, and volume spikes using market data and futures metrics.",
  "frontend/src/hooks/queries/opportunityRules.ts": "Selects scalping and swing trading opportunities by scoring market data on volume, volatility, momentum, and confidence.",
  "frontend/src/hooks/queries/unifiedSnapshot.ts": "Transforms backend UnifiedSnapshot into frontend BinanceMarketData and enriches it with technical analysis while validating fields.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including loading, login, logout, and status tracking.",
  "frontend/src/hooks/useOpportunities.ts": "Fetches Binance market data and computes categorized trading opportunities using predefined selection rules.",
  "frontend/src/hooks/usePWADiagnostics.ts": "Runs client-side checks for PWA readiness, including display mode, install prompt, service worker, manifest, and icon availability.",
  "frontend/src/hooks/usePWAInstall.ts": "Manages PWA installability state, install prompt handling, display mode detection, and installation events.",
  "frontend/src/hooks/useQueries.ts": "Provides hooks for fetching Binance market data, enriching it with technical analysis, and integrating learning and alert systems.",
  "frontend/src/hooks/useRadarSensitivity.ts": "Stores and updates radar sensitivity presets with localStorage syncing across tabs.",
  "frontend/src/hooks/useServiceWorkerUpdate.ts": "Detects service worker updates and exposes a method to trigger skip-waiting and reload.",
  "frontend/src/index.css": "Defines Tailwind layers, root CSS variables, theme variants, and background effects for dark neon and cyber glow modes.",
  "frontend/src/lib/learningEngine.ts": "Implements an IndexedDB‑backed learning engine for storing predictions, computing stats, and managing adaptive model config.",
  "frontend/src/lib/radarFilters.ts": "Provides radar filter defaults, persistence in localStorage, and utilities for loading, saving, and resetting anomaly-type filters.",
  "frontend/src/lib/radarSensitivity.ts": "Defines radar sensitivity presets with thresholds and persistence, and exposes helpers to get and apply the active policy.",
  "frontend/src/lib/resetFromScratch.ts": "Orchestrates full client-side reset by clearing IndexedDB, caches, service workers, and localStorage with a success flag.",
  "frontend/src/main.tsx": "Bootstraps the React app, providing React Query and Internet Identity context, and loads global CSS.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended theme colors tied to CSS variables, and utility plugins.",
  "project_state.json": "Stores project metadata, versioning, features, and planned improvements focused on Radar anomaly detection."
}