{
  "backend/DirectionType.mo": "Defines a simple enum-like type with up and down variants.",
  "backend/main.mo": "Actor managing market data storage, user preferences, caching, and filtering with placeholder Binance fetch logic.",
  "backend/MarketData.mo": "Defines MarketData with symbol, price, volume, and direction fields.",
  "backend/Theme.mo": "Defines a Theme type with darkNeon and cyberGlow variants.",
  "backend/UserPreferences.mo": "Defines user preference types including favourites, theme, alerts, language, and input with principal.",
  "feature_evidence.json": "Lists feature evidence mapping features to related frontend files and components.",
  "frontend-file-summaries.txt": "Provides high-level summaries of various frontend files and components.",
  "frontend/index.css": "Empty CSS file placeholder.",
  "frontend/index.html": "Main HTML entry with extensive PWA, iOS splash, and icon metadata.",
  "frontend/public/manifest.json": "PWA manifest defining icons, shortcuts, metadata, and display settings.",
  "frontend/public/sw.js": "Service worker v9 handling install, activate, caching, and fetch logic for PWA assets.",
  "frontend/src/App.tsx": "Main app component managing tabs, service worker updates, learning engine init, URL sync, and online status.",
  "frontend/src/components/AIPerformancePanel.tsx": "Shows AI learning stats for one or multiple assets, including levels, accuracy, and loading states.",
  "frontend/src/components/AppErrorBoundary.tsx": "Catches app-wide errors, displays a recovery UI, and clears caches before reloading.",
  "frontend/src/components/AssetResearch.tsx": "Provides asset search, symbol autocomplete, and detailed asset data retrieval from Binance.",
  "frontend/src/components/DataStatusIndicator.tsx": "Displays live data status, errors, stale indicators, and retry options based on query metadata.",
  "frontend/src/components/DynamicAlerts.tsx": "Generates real‑time radar and recommendation alerts with cooldown, filtering, and auto‑dismiss behavior.",
  "frontend/src/components/Footer.tsx": "No summary available.",
  "frontend/src/components/Header.tsx": "No summary available.",
  "frontend/src/components/ICPAnalysis.tsx": "No summary available.",
  "frontend/src/components/InstallPrompt.tsx": "No summary available.",
  "frontend/src/components/InstitutionalOrders.tsx": "No summary available.",
  "frontend/src/components/MarketCard.tsx": "No summary available.",
  "frontend/src/components/MarketOverview.tsx": "No summary available.",
  "frontend/src/components/MarketSnapshotDiagnostics.tsx": "No summary available.",
  "frontend/src/components/Opportunities.tsx": "Renders categorized trading opportunities with tabs, loading and error states, and a details side panel. Manages modality selection and displays opportunity cards with live freshness info.",
  "frontend/src/components/OpportunityDetailsPanel.tsx": "Shows detailed info for a selected trading opportunity including price, market data, and trade recommendations. Provides a closeable side panel UI with loading and error handling.",
  "frontend/src/components/OrderBook.tsx": "Displays futures and spot order book depth with formatting, refresh controls, and categorized error messaging. Supports aggregation levels and backend fallback indicators.",
  "frontend/src/components/PredictiveConfidencePanel.tsx": "Renders a confidence meter for predictive analysis with dynamic colors, badges, and compact or full layouts.",
  "frontend/src/components/PWADiagnosticsView.tsx": "Runs and displays PWA diagnostics such as display mode, install prompt status, and readiness. Shows statuses with icons, color coding, and refresh capability.",
  "frontend/src/components/PWAInstallDialog.tsx": "Dialog guiding users through installing the PWA, with platform-specific instructions and install actions. Supports iOS manual install steps and automatic browser-triggered installation.",
  "frontend/src/components/PWAInstallStatus.tsx": "Displays PWA install status, device support info, and actionable install guidance using badges and conditional UI states.",
  "frontend/src/components/RadarDashboard.tsx": "Implements the main radar view with market data, alerts, filters, learning indicators, and persisted user settings.",
  "frontend/src/components/ResetFromScratchDialog.tsx": "Confirmation dialog that wipes local data, shows progress, and reloads the app after a full reset.",
  "frontend/src/components/TabFetchErrorState.tsx": "Displays detailed fetch errors for tab content with reload actions and PWA cache warnings.",
  "frontend/src/components/TabPageCard.tsx": "Generic card layout wrapper for tab pages with icon, title, description, and children content.",
  "frontend/src/components/ThemeProvider.tsx": "Provides theme context and manages switching between stored themes by applying corresponding document classes.",
  "frontend/src/components/TopRecommendations.tsx": "Displays top asset recommendations by combining live market data with recommendation scores, handling loading and error states, and rendering detailed cards for each asset.",
  "frontend/src/components/UserPreferences.tsx": "Provides UI for user settings including theme, alerts, favorites, and PWA diagnostics, persisting preferences in localStorage.",
  "frontend/src/hooks/queries/analysisEnrichment.ts": "Generates enriched technical analysis for a ticker with confidence scoring, trend detection, learning-engine adjustments, manipulation zone detection, and institutional order signals.",
  "frontend/src/hooks/queries/binanceFetch.ts": "Fetches Binance Futures market data and individual asset tickers with error classification and handling for network and API restrictions.",
  "frontend/src/hooks/queries/binanceFuturesMetrics.ts": "Retrieves funding rates and open interest for Binance Futures symbols with partial-failure tolerance and in-memory metrics history support.",
  "frontend/src/hooks/queries/institutionalOrders.ts": "Implements institutional signal detection from BTC market data and provides React Query hooks to fetch and analyze spot and futures Binance data with fallback handling.",
  "frontend/src/hooks/queries/learningIntegration.ts": "Provides functions to record and update learning-engine predictions, prioritizing favourite symbols and applying configurable confidence thresholds.",
  "frontend/src/hooks/queries/localSignals.ts": "Generates trading recommendations and radar alerts using adaptive baselines, volatility checks, and multiple anomaly detectors.",
  "frontend/src/hooks/queries/opportunityRules.ts": "Defines deterministic scoring rules to select scalping and swing trading opportunities based on volume, volatility, momentum, and confidence metrics.",
  "frontend/src/hooks/queries/orderBookDepth.ts": "Fetches and parses Binance order book depth with detailed error classification and React Query hooks for futures and spot depth data.",
  "frontend/src/hooks/queries/unifiedSnapshot.ts": "Transforms backend unified snapshots into enriched market data with safe numeric parsing and advanced technical analysis integration.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates related queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, manages AuthClient lifecycle, and exposes identity, login, and logout state.",
  "frontend/src/hooks/useOpportunities.ts": "Calculates grouped trading opportunities using Binance market data and rule-based selectors.",
  "frontend/src/hooks/usePWADiagnostics.ts": "Runs PWA environment checks including display mode, service worker, manifest, and icon status to report issues.",
  "frontend/src/hooks/usePWAInstall.ts": "Tracks installability state, handles beforeinstallprompt events, and provides install/dismiss actions for PWA.",
  "frontend/src/hooks/useQueries.ts": "Wraps React Query hooks for Binance data, technical analysis enrichment, recommendation generation, and learning integration.",
  "frontend/src/hooks/useRadarSensitivity.ts": "Manages radar sensitivity presets with localStorage persistence and cross-tab synchronization.",
  "frontend/src/hooks/useServiceWorkerUpdate.ts": "Detects service worker updates and exposes a method to trigger activation and reload.",
  "frontend/src/hooks/useTradeRecommendation.ts": "React hook that selects market data for a symbol and modality and computes a trade recommendation using memoization.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining base variables, dark themes, and animated neon/cyber background styles.",
  "frontend/src/lib/learningEngine.ts": "IndexedDB‑backed learning engine that stores predictions, updates asset stats, manages config, and supports full DB reset.",
  "frontend/src/lib/orderBookDepth.ts": "Utility functions to parse, aggregate, and analyze order book depth, including wall detection and metric computation.",
  "frontend/src/lib/radarFilters.ts": "Manages radar filter settings with localStorage persistence, including anomaly type selection and thresholds.",
  "frontend/src/lib/radarSensitivity.ts": "Defines radar sensitivity presets, policies, and localStorage persistence for selecting and applying alert thresholds.",
  "frontend/src/lib/resetFromScratch.ts": "Provides full app reset by clearing IndexedDB, caches, service workers, and localStorage, plus helpers for reload and status.",
  "frontend/src/lib/tradeRecommendation.ts": "Defines trade recommendation types and computes entry/TP/SL and direction based on market data, modality parameters, and technical analysis.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity provider, rendering the main App component.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, themes, plugins, and container settings for styling.",
  "project_state.json": "Stores project state, features, issues, and requirements for implementing trade recommendations in the Opportunities area."
}