{
  "backend/DirectionType.mo": "Defines DirectionType with up/down variants.",
  "backend/main.mo": "Actor managing market data storage, user preferences, snapshot caching, and filtering utilities.",
  "backend/MarketData.mo": "Defines MarketData record including symbol, price, volume, and direction.",
  "backend/Theme.mo": "Defines Theme type with darkNeon and cyberGlow variants.",
  "backend/UserPreferences.mo": "Defines user preference types including favourites, theme, alerts, and language.",
  "feature_evidence.json": "Lists feature evidence mappings between features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for multiple frontend files and components.",
  "frontend/index.css": "Empty stylesheet placeholder for global styles.",
  "frontend/index.html": "Main HTML entry with extensive PWA meta tags, splash screens, and icons.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, display settings, shortcuts, and screenshots.",
  "frontend/public/sw.js": "Service worker v9 handling asset caching, activation cleanup, and fetch interception.",
  "frontend/src/App.tsx": "Main application component managing tabs, service worker updates, online status, auto‑generation of recommendations, radar alerts, and initialization of the learning engine.",
  "frontend/src/components/AIPerformancePanel.tsx": "Displays AI learning statistics for a specific asset or top assets, fetching data from the learning engine and rendering progress, labels, and metrics.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that displays a fallback UI on crashes, detects cache‑related issues, and allows users to clear caches and reload.",
  "frontend/src/components/AssetResearch.tsx": "Provides asset search and analysis using Binance data, including autocomplete, symbol selection, and predictive confidence panels.",
  "frontend/src/components/DataStatusIndicator.tsx": "Shows real‑time data status, errors, staleness, and last‑update info with retry options based on useDataStatus hook results.",
  "frontend/src/components/DynamicAlerts.tsx": "Generates temporary UI alerts for new radar signals and high‑confidence recommendations, respecting user preferences and favourites.",
  "frontend/src/components/Footer.tsx": "Renders a footer with branding and a link to caffeine.ai using lucide-react icons.",
  "frontend/src/components/Header.tsx": "Displays the app header with title and optional PWA install buttons tied to installability state.",
  "frontend/src/components/ICPAnalysis.tsx": "Shows detailed ICPUSDT market analysis with loading, no‑data, and styled bullish/bearish states.",
  "frontend/src/components/InstallPrompt.tsx": "Provides a timed PWA install prompt with dismiss logic and fallback to the install dialog.",
  "frontend/src/components/MarketCard.tsx": "Displays a selectable market summary card with price, change, volume, and confidence indicators.",
  "frontend/src/components/MarketOverview.tsx": "Shows a scrollable list of MarketCards and detailed analysis for the selected market with loading and error handling.",
  "frontend/src/components/MarketSnapshotDiagnostics.tsx": "Empty file with no implementation.",
  "frontend/src/components/PredictiveConfidencePanel.tsx": "Renders a confidence indicator for predictive analysis, with dynamic colors, badges, and progress visualization based on confidence level.",
  "frontend/src/components/PWADiagnosticsView.tsx": "Displays detailed PWA diagnostics including display mode, install status, and refresh controls.",
  "frontend/src/components/PWAInstallDialog.tsx": "Displays a dialog guiding users through installing the PWA, with different instructions and actions for iOS and non‑iOS devices.",
  "frontend/src/components/PWAInstallStatus.tsx": "Shows current PWA installability and display mode, offering install actions and status details depending on platform and state.",
  "frontend/src/components/RadarDashboard.tsx": "Generates and displays radar alerts based on market anomalies, with filtering, confidence thresholds, and new‑alert detection animations.",
  "frontend/src/components/ResetFromScratchDialog.tsx": "Provides a confirmation dialog to fully reset local data and reload the app, showing progress and error toasts.",
  "frontend/src/components/TabFetchErrorState.tsx": "Displays an error state for tab data loading, including error details, PWA cache warnings, and a reload button.",
  "frontend/src/components/ThemeProvider.tsx": "Manages app theme state, syncing it with localStorage and applying corresponding CSS classes to the document root.",
  "frontend/src/components/TopRecommendations.tsx": "Displays top asset recommendations using market and recommendation data, handling loading and error states and rendering detailed recommendation cards. Fetches combined analysis and shows alerts when recommendations are unavailable.",
  "frontend/src/components/UserPreferences.tsx": "Provides UI for managing theme, alerts, learning prioritization, and favorite assets with localStorage persistence. Integrates PWA tools and market data for asset selection.",
  "frontend/src/hooks/queries/analysisEnrichment.ts": "Computes enriched technical analysis for a ticker including trend, strength, predictions, confidence, and detection of manipulation and institutional zones. Integrates learningEngine to adjust confidence and generate tags.",
  "frontend/src/hooks/queries/binanceFetch.ts": "Fetches Binance Futures USD‑M market data and individual asset data with error handling for network issues and restricted responses. Also provides a filter for major trading pairs.",
  "frontend/src/hooks/queries/learningIntegration.ts": "Records and updates AI learning predictions from market data, optionally prioritizing user‑favorite assets. Interacts with learningEngine to store predictions and update asset stats.",
  "frontend/src/hooks/queries/localSignals.ts": "Generates bullish-based recommendations and anomaly-driven radar alerts using market trends, strength, confidence, and volume/price deviations. Sorts and filters assets to produce concise signal outputs.",
  "frontend/src/hooks/queries/unifiedSnapshot.ts": "Validates and transforms backend UnifiedSnapshot data into enriched BinanceMarketData with technical analysis.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and state management for Internet Identity authentication, login, and identity persistence.",
  "frontend/src/hooks/usePWADiagnostics.ts": "Runs checks on PWA installability, service worker status, manifest, icons, and reports issues and readiness state.",
  "frontend/src/hooks/usePWAInstall.ts": "Tracks install prompt events, device conditions, install state, and provides functions to trigger or dismiss PWA installation.",
  "frontend/src/hooks/useQueries.ts": "Defines types and React Query hooks for fetching Binance data, enriching it with technical analysis, and integrating learning logic.",
  "frontend/src/hooks/useServiceWorkerUpdate.ts": "React hook that detects service worker updates and exposes a method to trigger skip-waiting and reload.",
  "frontend/src/index.css": "Tailwind base styles plus custom OKLCH theme variables and neon/cyber-dark theme definitions with background effects.",
  "frontend/src/lib/learningEngine.ts": "IndexedDB‑backed engine for storing predictions, computing stats, and managing adaptive learning config for assets.",
  "frontend/src/lib/resetFromScratch.ts": "Utility that clears IndexedDB, caches, localStorage, and service workers to fully reset the app state.",
  "frontend/src/main.tsx": "App entry point that mounts React, sets up React Query, and wraps the app with Internet Identity provider.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, themes, radii, shadows, and enabling plugins like typography and animations.",
  "project_state.json": "Metadata describing project architecture, current issues, and high‑level state for the Crypto Market Assistant PWA."
}