{
  "backend/DirectionType.mo": "Defines a DirectionType variant with #up and #down options for market direction.",
  "backend/main.mo": "Main backend actor with market data caching, snapshot management, asset filtering, user preferences storage, and placeholder Binance futures data fetching.",
  "backend/MarketData.mo": "Defines MarketData record type with symbol, price, volume, and direction fields.",
  "backend/Theme.mo": "Defines Theme variant with #darkNeon and #cyberGlow options for UI theming.",
  "backend/UserPreferences.mo": "Defines UserPreferences and UserPreferencesInput types for storing user settings including favorites, theme, alerts, and language.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features for displaying optimal buy/sell/stop-loss points using frontend-only technical analysis without new backend HTTP calls.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including market overview, recommendations, radar dashboard, PWA configuration, and technical analysis features with live Binance data fetching.",
  "frontend/index.css": "Empty CSS file (content truncated or not present).",
  "frontend/index.html": "HTML entry point with comprehensive PWA meta tags, iOS splash screens, app icons, and standalone mode configuration for installable web app.",
  "frontend/public/manifest.json": "PWA manifest with standalone display mode, app metadata, multiple icon sizes including maskable, screenshots, and shortcuts to key app tabs.",
  "frontend/public/sw.js": "Service worker v9 implementing static asset caching, runtime caching, cache cleanup on activation, and offline fallback with critical asset verification.",
  "frontend/src/App.tsx": "Main application component that manages tab navigation, service worker registration, PWA functionality, online/offline status, and initializes the learning engine with periodic data cleanup.",
  "frontend/src/components/AIPerformancePanel.tsx": "Displays AI learning statistics for assets including learning level, accuracy rate, prediction count, and confidence metrics with visual progress bars and badges.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary component that catches application errors, detects PWA cache mismatches, and provides a UI to reload the app with cache clearing.",
  "frontend/src/components/AssetResearch.tsx": "Asset research interface with autocomplete search for Binance Futures symbols, displays selected asset details, and integrates predictive confidence analysis.",
  "frontend/src/components/DataStatusIndicator.tsx": "Fixed position status indicator that displays data freshness, errors, and connection status with retry functionality and last update timestamps.",
  "frontend/src/components/DynamicAlerts.tsx": "Toast-style notification system for radar alerts and recommendations with sensitivity-aware cooldowns, confidence thresholds, and auto-dismiss timers.",
  "frontend/src/components/Footer.tsx": "A simple footer component displaying copyright text with a heart icon and a link to caffeine.ai, styled with responsive classes and safe-bottom padding.",
  "frontend/src/components/Header.tsx": "Header component with app branding (Crypto Market Assistant), logo, and a conditional PWA install button that shows when the app is installable but not yet installed.",
  "frontend/src/components/ICPAnalysis.tsx": "Displays detailed analysis for ICP (Internet Computer) cryptocurrency including price, change percentage, manipulation zones, institutional orders, and predictive confidence panels with neon-styled UI.",
  "frontend/src/components/InstallPrompt.tsx": "A proactive PWA install prompt that appears after 3 seconds if the app is installable, showing a card with install instructions and opening a dialog for installation guidance.",
  "frontend/src/components/InstitutionalOrders.tsx": "Displays BTC institutional buy/sell signals for both Futures (USD-M) and Spot markets with refresh functionality, error categorization, and formatted price/timestamp displays.",
  "frontend/src/components/MarketCard.tsx": "A clickable card component displaying individual market data (symbol, price, 24h change, volume, strength, confidence) with neon-styled borders and hover effects based on bullish/bearish sentiment.",
  "frontend/src/components/MarketOverview.tsx": "Main market overview component showing a grid of market cards from Binance Futures USD-M data, with selection functionality and detailed analysis panels for the selected market including predictive confidence and AI performance.",
  "frontend/src/components/MarketSnapshotDiagnostics.tsx": "File appears to be empty or truncated in the provided content.",
  "frontend/src/components/Opportunities.tsx": "Main component displaying trading opportunities across multiple modalities (scalping, swing, breakout, reversal, SMC, FVG) with tabbed navigation, opportunity cards, and a details panel for selected symbols.",
  "frontend/src/components/OpportunityDetailsPanel.tsx": "Side panel component showing detailed trade setup information for a selected symbol, including current price, trade recommendation with entry/exit points, stop loss, and risk/reward metrics.",
  "frontend/src/components/OrderBook.tsx": "Component displaying order book depth data for both futures and spot markets with configurable aggregation levels, bid/ask tables, error handling, and refresh functionality.",
  "frontend/src/components/PredictiveConfidencePanel.tsx": "Renders a confidence meter for technical analysis predictions with color-coded gradients (green/cyan/purple) based on confidence levels. Supports both compact and full card layouts with animated progress bars and confidence badges.",
  "frontend/src/components/PWADiagnosticsView.tsx": "Diagnostic view component showing PWA installation status, display mode, install prompt availability, and technical information about the app's standalone capabilities.",
  "frontend/src/components/PWAInstallDialog.tsx": "Dialog component providing PWA installation instructions with platform-specific guidance for iOS (Safari share menu) and other platforms (direct install button).",
  "frontend/src/components/PWAInstallStatus.tsx": "Displays PWA installation status with badges and instructions for different platforms (Android/iOS), showing whether the app is installed, installable, or not supported. Provides install buttons and platform-specific guidance for adding the app to home screen.",
  "frontend/src/components/RadarDashboard.tsx": "Main dashboard for monitoring market anomalies and radar alerts with filtering by trend, confidence, and anomaly types (price moves, volume spikes, volatility, etc.). Manages alert state, learning data enrichment, and persists filter preferences to localStorage.",
  "frontend/src/components/ResetFromScratchDialog.tsx": "Confirmation dialog for resetting all app data including AI learning history, user preferences, and caches. Handles the reset operation with loading states and reloads the app after successful reset.",
  "frontend/src/components/TabFetchErrorState.tsx": "Error state component for tab data loading failures, displaying error details and a reload button. Includes special handling for PWA cache mismatch errors with helpful guidance.",
  "frontend/src/components/TabPageCard.tsx": "Reusable card wrapper component for tab pages with neon-styled borders, supporting icon, title, description, badge, and children content. Provides consistent styling across tab interfaces.",
  "frontend/src/components/ThemeProvider.tsx": "React context provider for managing theme switching between 'darkNeon' and 'cyberGlow' themes. Applies theme classes to document root, persists selection to localStorage, and provides useTheme hook for theme access.",
  "frontend/src/components/TopRecommendations.tsx": "React component that displays top 10 trading recommendations with confidence scores, learning levels, and institutional analysis. Integrates market data, predictive confidence panels, and AI performance metrics with loading/error states.",
  "frontend/src/components/UserPreferences.tsx": "User preferences component managing favorite assets, theme selection (Dark Neon/Cyber Glow), alert toggles, and AI learning prioritization. Includes PWA install status, diagnostics, and a reset-from-scratch dialog.",
  "frontend/src/hooks/queries/analysisEnrichment.ts": "Calculates advanced technical analysis including trend strength, support/resistance zones, manipulation zones, institutional orders, and confidence scoring. Integrates with learning engine to optimize predictions based on historical performance.",
  "frontend/src/hooks/queries/binanceFetch.ts": "Browser-based fetching functions for Binance Futures USD-M API, including 24hr ticker data and specific asset lookups. Handles network errors, API blocks, and restricted location responses with detailed error classification.",
  "frontend/src/hooks/queries/binanceFuturesMetrics.ts": "Fetches Binance Futures funding rates and open interest data with safe partial-failure handling. Includes session-based in-memory storage for tracking metric changes over time.",
  "frontend/src/hooks/queries/institutionalOrders.ts": "Detects institutional trading signals from BTC market data (Futures and Spot) using volume patterns, price action, and directional momentum. Includes hardened edge-case handling for invalid inputs and zero ranges.",
  "frontend/src/hooks/queries/learningIntegration.ts": "Integrates with the learning engine to record predictions and update results, with optional prioritization for favorite assets by lowering confidence thresholds and sorting market data.",
  "frontend/src/hooks/queries/localSignals.ts": "Generates trading recommendations and radar alerts from market data using adaptive baselines, anomaly detection (price moves, volume spikes, volatility, funding irregularities), and funding/open interest metrics.",
  "frontend/src/hooks/queries/opportunityRules.ts": "Defines rule-based opportunity selection for scalping (high volume, low volatility, frequent trades) and swing trading (medium-term trends, strong momentum) with deterministic scoring and sorting.",
  "frontend/src/hooks/queries/orderBookDepth.ts": "React Query hooks for fetching and parsing BTC order book depth from Binance Futures and Spot APIs, with error classification, CORS handling, and backend fallback support.",
  "frontend/src/hooks/queries/unifiedSnapshot.ts": "Transforms backend UnifiedSnapshot data into frontend-compatible BinanceMarketData format with technical analysis enrichment, including safe number conversion and validation for bigint/number types.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, delegation identity management, and automatic identity restoration from local storage using @dfinity/auth-client.",
  "frontend/src/hooks/useOpportunities.ts": "Computes trading opportunities grouped by modality (scalping, swing, breakout, reversal, SMC, FVG) by applying deterministic selection rules to live Binance market data.",
  "frontend/src/hooks/usePWADiagnostics.ts": "Runs comprehensive PWA diagnostics checking display mode, service worker status, manifest availability, and critical icon accessibility, returning issues and readiness state.",
  "frontend/src/hooks/usePWAInstall.ts": "Manages PWA installation state by capturing beforeinstallprompt events, detecting iOS devices, tracking dismissal state, and providing install prompt functionality with display mode detection.",
  "frontend/src/hooks/useQueries.ts": "Fetches and enriches Binance Futures market data with technical analysis, generates recommendations and radar alerts, integrates learning engine predictions, and manages data status with React Query.",
  "frontend/src/hooks/useRadarSensitivity.ts": "Manages radar sensitivity preset (conservative/balanced/aggressive) with localStorage persistence and cross-tab synchronization via storage events.",
  "frontend/src/hooks/useServiceWorkerUpdate.ts": "Detects service worker updates by monitoring registration state changes and provides a function to skip waiting and reload the app when updates are available.",
  "frontend/src/hooks/useTradeRecommendation.ts": "React hook that computes trade recommendations for a selected symbol and modality by finding the asset in market data and calling the computeTradeRecommendation function.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom dark theme variables, two neon theme variants (dark-neon and cyber-glow), and global styles including smooth scrolling and animated background gradients.",
  "frontend/src/lib/learningEngine.ts": "IndexedDB-based continuous learning engine that stores prediction records, tracks accuracy per asset, and adaptively adjusts indicator weights based on prediction outcomes.",
  "frontend/src/lib/orderBookDepth.ts": "Utilities for parsing, aggregating, and analyzing order book depth data including bid/ask levels, wall detection, and metrics like mid-price, spread, and imbalance.",
  "frontend/src/lib/radarFilters.ts": "Manages radar filter persistence in localStorage for anomaly types, minimum score, and confidence thresholds with load/save/reset functions.",
  "frontend/src/lib/radarSensitivity.ts": "Defines three radar sensitivity presets (conservative, balanced, aggressive) with detection thresholds and notification policies, persisted in localStorage.",
  "frontend/src/lib/resetFromScratch.ts": "Orchestrates complete app data reset by clearing IndexedDB, localStorage, CacheStorage, and unregistering service workers, with success flag tracking and reload functionality.",
  "frontend/src/lib/tradeRecommendation.ts": "Defines types and logic for computing trade recommendations (entry, take profit, stop loss) based on trading modality and Binance market data, using only frontend-fetched data without backend calls.",
  "frontend/src/main.tsx": "React application entry point that sets up QueryClient, InternetIdentityProvider, and renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes (including neon colors), container settings, border radius, and shadow utilities for the UI.",
  "project_state.json": "Project metadata tracking architectural constraints (frontend-only Binance data, backend CoinGecko only), existing features for buy/sell/stop-loss analysis, and known IP blocking issues with ICP canisters."
}