{
  "kind": "build_request",
  "title": "Refine Radar anomaly detection with smarter filters and earlier signals",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Refine the Radar anomaly detection logic to detect abnormal moves earlier and reduce false positives by replacing the current fixed baselines and thresholds with adaptive, market-relative scoring.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Vamos refinar o radar . Acho a melhor ação para agora."
        ]
      },
      "acceptanceCriteria": [
        "Radar alerts are still produced via the existing react-query hook (useRadarAlerts) and render in the Radar tab without runtime errors.",
        "The anomaly score uses adaptive baselines derived from the current marketData set (e.g., relative/percentile-based volume baseline instead of a single hard-coded avgVolume constant), so alerts remain meaningful across different market regimes.",
        "“Earlier detection” is achieved by making the price-move/volatility detection sensitive to smaller moves when corroborated by at least one other signal (e.g., volume spike, extreme volatility, funding irregularity, or open interest spike).",
        "Alert confidence is normalized to 0..1 and is monotonic with severity (higher anomaly severity yields higher confidence).",
        "Radar alerts remain sorted by highest severity/score first, and the alert object fields expected by the UI (symbol, percentChange, volumeDelta, direction, confidence, anomalyScore, anomalyTypes, reasons, timestamp) are preserved."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add smarter Radar filters in the Radar UI so users can narrow alerts by anomaly type(s) and severity, in addition to the existing trend and min-confidence filters.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Vamos refinar o radar . Acho a melhor ação para agora."
        ]
      },
      "acceptanceCriteria": [
        "Radar tab includes a filter control to include/exclude alerts by anomaly type (Price Move, Volume Spike, Extreme Volatility, Funding Alert, OI Spike).",
        "Radar tab includes a severity control (e.g., min anomaly score and/or min confidence) that actually changes the visible list.",
        "Existing filters (All/Bullish/Bearish/Learning and Min Confidence) continue to work as before.",
        "Filters do not require backend changes and persist across reloads (e.g., via localStorage) unless explicitly reset by the user."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Introduce a user-facing “Radar Sensitivity” setting that tunes detection thresholds (e.g., Conservative / Balanced / Aggressive) and apply it consistently to both the Radar list and the top-of-screen Dynamic Alerts notifications.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Vamos refinar o radar . Acho a melhor ação para agora."
        ]
      },
      "acceptanceCriteria": [
        "Radar tab provides a Sensitivity selector with at least three presets (Conservative, Balanced, Aggressive) using clear English labels.",
        "Changing sensitivity immediately affects which alerts are generated/shown (without needing a hard refresh).",
        "DynamicAlerts notifications use the same sensitivity policy (e.g., confidence cutoff/cooldown) so notifications match what the Radar is considering “high enough confidence.”",
        "Sensitivity choice persists across reloads (localStorage is acceptable)."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (read-only components must be composed, not modified).",
    "Do not modify immutable frontend paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Keep all backend Motoko logic in the single actor (backend/main.mo); avoid backend changes unless strictly required for Radar refinement."
  ],
  "nonGoals": [
    "Implementing the Binance API key / read-only authenticated trade monitoring tab.",
    "Replacing or redesigning the Sentiment tab data sources.",
    "PWA installation/standalone-mode fixes.",
    "General visual theme redesign outside of Radar-specific filter controls."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}