{
  "kind": "build_request",
  "title": "Unify visual layout for Radar and Trading Opportunities tabs",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Radar tab UI (frontend/src/components/RadarDashboard.tsx) so its overall page layout, spacing, and primary container styling match the established visual pattern used by the other tabs (e.g., Market Overview / Top Recommendations): a consistent top-level structure without extra/inconsistent padding and with a primary Card container using the same theme-driven border/background/backdrop styles.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-12"
        ],
        "quotes": [
          "As abas Radar e Trading Opportunity devem ter o mesmo formato visual que as outras abas."
        ]
      },
      "acceptanceCriteria": [
        "Radar tab no longer adds extra outer padding/margins that make it look visually different from other tabs (e.g., remove/adjust any redundant outer `p-4` wrappers when TabsContent already controls spacing).",
        "Radar tab has a single, consistent top-level container structure aligned with other tabs (Card-based header/section styling consistent with existing tab patterns).",
        "Visual elements (header block, filter block, list container) align with the app’s existing theme variables and common Card/backdrop treatment used elsewhere (no bespoke gradient treatment that makes Radar look like a different template)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the Trading Opportunities tab UI (frontend/src/components/Opportunities.tsx) so its page header and primary container styling match the established visual pattern used by the other tabs (e.g., Market Overview / Top Recommendations), replacing any standalone heading layout with the same Card-based header/container approach.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-12"
        ],
        "quotes": [
          "As abas Radar e Trading Opportunity devem ter o mesmo formato visual que as outras abas."
        ]
      },
      "acceptanceCriteria": [
        "The Opportunities tab renders its main title/description inside a CardHeader/Card layout consistent with other tabs (instead of a standalone h1 block).",
        "The Opportunities tab’s top-level styling (borders/background/backdrop/shadow treatment) visually matches the common tab template used by MarketOverview/TopRecommendations.",
        "No regressions to existing Opportunities functionality: modality tabs still switch content correctly; loading/error/empty states still render."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (shadcn components are read-only and must be composed, not edited).",
    "Keep changes limited to visual/layout consistency; do not change backend APIs or data-fetching behavior."
  ],
  "nonGoals": [
    "Translating the entire application UI to English or Portuguese.",
    "Redesigning the information architecture or adding new features to Radar or Opportunities.",
    "Changing alert/opportunity scoring logic or react-query caching behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}