{
  "kind": "build_request",
  "title": "Add trade recommendations to Opportunities (Long/Short + Entry/TP/SL by modality)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In the Opportunities area, allow the user to select an opportunity (asset) from any modality list and open a details view (e.g., dialog/drawer/side panel) for that selected symbol.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Vamos trabalhar na area de oportunidades.. \nApos selecionarmos algum ativo nesta area."
        ]
      },
      "acceptanceCriteria": [
        "From any Opportunities tab (scalping/swing/breakout/reversal/smc/fvg), clicking an opportunity card opens a dedicated details UI for that symbol.",
        "The details UI shows, at minimum, the symbol and current price (using the existing opportunity data).",
        "The user can close the details UI and return to the Opportunities list without losing the currently selected modality tab."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Generate and display a trade recommendation for the selected opportunity based on the currently selected trade modality (the active Opportunities tab). The recommendation must include: direction (Long or Short), recommended Entry, Take Profit, and Stop Loss values, derived from existing live market data and the app’s existing analysis data (e.g., support/resistance zones, trend, confidence, institutional/manipulation signals).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Seria bom que uma recomendação de trade fosse oferecida. Baseada na modalidade de trade escolhida.",
          "O aplicativo deve indicar se a oportunidade é de long ou de short.. e fornecer os valores recomendados de entrada, take profit, stop loss, baseados nos dados e base de dados que temos."
        ]
      },
      "acceptanceCriteria": [
        "When an opportunity is selected, the details UI shows a clearly labeled “Trade Recommendation” section.",
        "The “Trade Recommendation” section shows: Direction (Long/Short), Entry, Take Profit, Stop Loss.",
        "The recommendation changes when the user changes the modality tab and selects an asset within that modality (i.e., modality influences the output).",
        "Entry/TP/SL values are computed deterministically from currently available app data for that symbol (no hardcoded per-symbol values).",
        "If required analysis inputs for a symbol are unavailable, the UI shows a graceful fallback state explaining the recommendation cannot be computed right now (without crashing the Opportunities page)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Include transparent justification metadata in the recommendation UI by reusing existing signals already shown elsewhere in the app (e.g., trend, confidence, support/resistance references, institutional/manipulation tags), so the user can understand why the app suggests Long/Short and the chosen levels.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "...baseados nos dados e base de dados que temos."
        ]
      },
      "acceptanceCriteria": [
        "The recommendation UI displays a short list of “Rationale” or “Signals” that references existing computed indicators (e.g., trend/confidence/nearest support-resistance, or existing reasons/tags already computed by the app).",
        "Rationale content updates together with the recommendation for the selected symbol/modality.",
        "No new external APIs are introduced for rationale generation."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only UI components); compose them instead.",
    "Do not edit immutable hook files: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo if a stable-state upgrade is required."
  ],
  "nonGoals": [
    "Fixing the current deployment/publishing failure (not requested in the active scope).",
    "Adding real-money execution, exchange order placement, or account connectivity.",
    "Adding third-party authentication providers or external databases."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}