{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Radar: adaptive anomaly scoring, smarter filters, and sensitivity presets",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace fixed Radar baselines/thresholds with adaptive, market-relative anomaly scoring and earlier corroborated signals while preserving alert shape and ordering.",
      "acceptanceCriteria": [
        "Radar alerts are still produced via the existing react-query hook (useRadarAlerts) and render in the Radar tab without runtime errors.",
        "The anomaly score uses adaptive baselines derived from the current marketData set (e.g., relative/percentile-based volume baseline instead of a single hard-coded avgVolume constant), so alerts remain meaningful across different market regimes.",
        "“Earlier detection” is achieved by making the price-move/volatility detection sensitive to smaller moves when corroborated by at least one other signal (e.g., volume spike, extreme volatility, funding irregularity, or open interest spike).",
        "Alert confidence is normalized to 0..1 and is monotonic with severity (higher anomaly severity yields higher confidence).",
        "Radar alerts remain sorted by highest severity/score first, and the alert object fields expected by the UI (symbol, percentChange, volumeDelta, direction, confidence, anomalyScore, anomalyTypes, reasons, timestamp) are preserved."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/queries/localSignals.ts",
          "operation": "modify",
          "description": "Refactor generateRadarAlerts() to compute adaptive, market-relative baselines (e.g., percentile/median-based volume and move baselines computed from the provided marketData list) and replace fixed thresholds with sensitivity-adjusted gating. Implement corroboration-based earlier detection (smaller price/volatility moves qualify when at least one other anomaly type is present). Ensure anomalyScore represents severity used for sorting (highest first), and confidence is a 0..1 normalized monotonic function of severity. Preserve required alert fields (symbol, percentChange, volumeDelta, direction, confidence, anomalyScore, anomalyTypes, reasons, timestamp) and keep stable sorting by anomalyScore descending."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update useRadarAlerts() to support passing a Radar sensitivity policy into alert generation (e.g., include sensitivity in the react-query queryKey and pass it to generateRadarAlerts) while keeping the same hook name and return type so the Radar tab renders without runtime errors."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add Radar UI filters for anomaly type(s) and severity, persisting selections across reloads without backend changes.",
      "acceptanceCriteria": [
        "Radar tab includes a filter control to include/exclude alerts by anomaly type (Price Move, Volume Spike, Extreme Volatility, Funding Alert, OI Spike).",
        "Radar tab includes a severity control (e.g., min anomaly score and/or min confidence) that actually changes the visible list.",
        "Existing filters (All/Bullish/Bearish/Learning and Min Confidence) continue to work as before.",
        "Filters do not require backend changes and persist across reloads (e.g., via localStorage) unless explicitly reset by the user."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/RadarDashboard.tsx",
          "operation": "modify",
          "description": "Extend the existing Filters card to include (1) an anomaly-type include/exclude control for the five AnomalyType values and (2) a severity filter (e.g., min anomalyScore presets and/or a tighter min-confidence option) that changes the displayed list. Persist filter state to localStorage and restore it on load; add a user-visible reset action that clears the saved filter values. Compose existing shadcn-ui components already used here (e.g., Button/Badge/Card/ScrollArea) to build these controls (do not modify anything under frontend/src/components/ui). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/lib/radarFilters.ts",
          "operation": "create",
          "description": "Add small, reusable helpers for Radar filter persistence and defaults (localStorage read/write, schema-safe parsing, and reset) to keep RadarDashboard.tsx lean and to ensure filters survive reloads."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Introduce a persistent Radar Sensitivity setting (Conservative/Balanced/Aggressive) and apply it consistently to both Radar list generation and DynamicAlerts notifications.",
      "acceptanceCriteria": [
        "Radar tab provides a Sensitivity selector with at least three presets (Conservative, Balanced, Aggressive) using clear English labels.",
        "Changing sensitivity immediately affects which alerts are generated/shown (without needing a hard refresh).",
        "DynamicAlerts notifications use the same sensitivity policy (e.g., confidence cutoff/cooldown) so notifications match what the Radar is considering “high enough confidence.”",
        "Sensitivity choice persists across reloads (localStorage is acceptable)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/radarSensitivity.ts",
          "operation": "create",
          "description": "Define the RadarSensitivity preset type (Conservative/Balanced/Aggressive), localStorage persistence utilities, and a shared policy mapping (e.g., confidence cutoff, notification cooldown/dedupe window, and detection aggressiveness multipliers) so Radar generation and DynamicAlerts share the same rules."
        },
        {
          "path": "frontend/src/hooks/useRadarSensitivity.ts",
          "operation": "create",
          "description": "Create a lightweight hook to read/update the sensitivity preset (backed by localStorage) and expose the computed sensitivity policy. Use this hook from RadarDashboard and DynamicAlerts so changes apply immediately without refresh."
        },
        {
          "path": "frontend/src/components/RadarDashboard.tsx",
          "operation": "modify",
          "description": "Add a Sensitivity selector UI (three clear English preset buttons or a compact selector) within the existing Filters area, wired to the shared useRadarSensitivity hook and persisted via localStorage. Ensure changing sensitivity triggers updated alert generation via useRadarAlerts (through sensitivity-aware queryKey) and does not break existing Trend/Min Confidence/Learning filters. Compose existing shadcn-ui components (e.g., Button/Card/Badge) without modifying frontend/src/components/ui. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Plumb the selected sensitivity (from radarSensitivity utilities or a hook-safe accessor) into useRadarAlerts() so alert generation and react-query caching/refetching update immediately when sensitivity changes."
        },
        {
          "path": "frontend/src/components/DynamicAlerts.tsx",
          "operation": "modify",
          "description": "Apply the same sensitivity policy used by Radar to DynamicAlerts radar notifications (e.g., confidence cutoff and dedupe/cooldown window) so notifications match Radar’s 'high enough confidence' definition. Read sensitivity via the shared hook/util and keep the existing enable-alerts localStorage behavior intact. Compose existing UI patterns; do not modify frontend/src/components/ui. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/queries/localSignals.ts",
          "operation": "modify",
          "description": "Update generateRadarAlerts() signature/behavior to accept a sensitivity policy (or preset) and apply it consistently to detection gating (threshold multipliers and corroboration rules) so the Radar list changes immediately when sensitivity changes."
        }
      ]
    }
  ]
}