{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Rebuild clean deployment package for version 49",
  "requirements": [
    {
      "id": "REQ-5",
      "summary": "Generate a clean version 49 deployment package preserving all existing functionality including market overview, recommendations, radar dashboard, trading opportunities with all 6 modalities, order book analysis, institutional orders detection, and complete PWA features with offline support",
      "acceptanceCriteria": [
        "Version 49 successfully deploys to production without deployment errors",
        "All market data fetching and display functionality works correctly",
        "Radar dashboard with anomaly detection and filtering operates as expected",
        "Trading opportunities for all 6 modalities display correctly with details panel",
        "PWA installs successfully on mobile devices with offline functionality",
        "Service worker caches assets properly and handles updates",
        "Internet Identity authentication flow works correctly",
        "All existing user preferences and AI learning features function properly"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Verify and preserve all existing routing logic for tabs (mercado, recomendacoes, radar, opportunities, pesquisa, preferencias), service worker registration with update detection, learning engine initialization, and online/offline status handling. Ensure tab navigation with URL parameters remains intact and update prompts display correctly."
        },
        {
          "path": "frontend/src/components/MarketOverview.tsx",
          "operation": "modify",
          "description": "Verify market overview grid displays correctly with selection functionality and detailed analysis panel. Ensure predictive confidence, AI performance indicators, and learning statistics render properly for selected markets."
        },
        {
          "path": "frontend/src/components/TopRecommendations.tsx",
          "operation": "modify",
          "description": "Verify top 10 recommendations display with confidence scores, learning levels, and institutional analysis. Ensure loading states, error handling, and scrollable cards with badges for high confidence and AI learning status work correctly."
        },
        {
          "path": "frontend/src/components/RadarDashboard.tsx",
          "operation": "modify",
          "description": "Verify radar dashboard monitoring functionality with filtering by trend, confidence, and anomaly types. Ensure sensitivity presets, new alert tracking, learning data enrichment, and localStorage filter persistence operate correctly."
        },
        {
          "path": "frontend/src/components/Opportunities.tsx",
          "operation": "modify",
          "description": "Verify trading opportunities display organized by all 6 modalities (scalping, swing, breakout, reversal, SMC, FVG) in tabbed interface. Ensure cards show symbol, score, and metrics correctly with click handlers to open details panel."
        },
        {
          "path": "frontend/src/components/OpportunityDetailsPanel.tsx",
          "operation": "modify",
          "description": "Verify side panel displays detailed trade setup information for selected symbol/modality including current price, entry/exit/stop-loss levels, and risk/reward calculations from useTradeRecommendation hook."
        },
        {
          "path": "frontend/src/components/OrderBook.tsx",
          "operation": "modify",
          "description": "Verify order book depth data display for both futures and spot markets with configurable aggregation levels, bid/ask tables, refresh functionality, and proper error categorization for network/API issues."
        },
        {
          "path": "frontend/src/components/InstitutionalOrders.tsx",
          "operation": "modify",
          "description": "Verify institutional buy/sell orders display for BTC on both Futures (USD-M) and Spot markets. Ensure refresh functionality, error categorization, and formatted price/timestamp displays with loading skeletons work correctly."
        },
        {
          "path": "frontend/src/components/AssetResearch.tsx",
          "operation": "modify",
          "description": "Verify asset search and research component fetches Binance Futures symbols correctly, provides autocomplete search, and displays detailed asset information with predictive confidence panels. Ensure market data query integration and symbol selection handling work properly."
        },
        {
          "path": "frontend/src/components/UserPreferences.tsx",
          "operation": "modify",
          "description": "Verify user preferences management including favorite assets, theme selection (Dark Neon/Cyber Glow), alert toggles, and AI learning prioritization. Ensure PWA install status, diagnostics view, and reset dialog with localStorage persistence function correctly."
        },
        {
          "path": "frontend/public/sw.js",
          "operation": "modify",
          "description": "Verify service worker v9 implements static asset caching, runtime caching, old cache cleanup, and critical asset verification for offline PWA functionality. Ensure version increment is maintained and cache strategies work correctly."
        },
        {
          "path": "frontend/public/manifest.json",
          "operation": "modify",
          "description": "Verify PWA manifest with standalone display mode, multiple icon sizes including maskable variants, screenshots, and shortcuts to key app sections (Mercado, Radar, Recomendações, Opportunities, Pesquisa) are correctly configured."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Verify HTML entry point contains comprehensive PWA meta tags, iOS splash screens for all device sizes, app icons in multiple sizes, and standalone mode configuration for mobile installation. Wire generated splash screen images from frontend/public/assets/generated/ios-splash-*.png as link tags with appropriate media queries for each iOS device resolution."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Verify hook fetches and enriches Binance Futures market data with advanced technical analysis, generates recommendations and radar alerts, integrates with learning engine for prediction tracking, and manages data status with React Query."
        },
        {
          "path": "frontend/src/hooks/useOpportunities.ts",
          "operation": "modify",
          "description": "Verify hook computes trading opportunities grouped by all 6 modalities (scalping, swing, breakout, reversal, SMC, FVG) by applying deterministic selection rules to live Binance market data."
        },
        {
          "path": "frontend/src/hooks/useTradeRecommendation.ts",
          "operation": "modify",
          "description": "Verify hook computes trade recommendations for selected symbol and modality by finding asset in market data and calling computeTradeRecommendation function."
        },
        {
          "path": "frontend/src/hooks/usePWAInstall.ts",
          "operation": "modify",
          "description": "Verify hook manages PWA installation state by capturing beforeinstallprompt event, detecting iOS devices, tracking dismissal state, and providing methods to trigger or dismiss install prompt."
        },
        {
          "path": "frontend/src/hooks/useServiceWorkerUpdate.ts",
          "operation": "modify",
          "description": "Verify hook detects when new service worker is available, tracks waiting worker, and provides method to skip waiting and reload page to activate update."
        },
        {
          "path": "frontend/src/lib/learningEngine.ts",
          "operation": "modify",
          "description": "Verify continuous learning engine stores prediction records and asset learning statistics in IndexedDB, adjusting indicator weights based on prediction accuracy over time."
        },
        {
          "path": "frontend/src/lib/resetFromScratch.ts",
          "operation": "modify",
          "description": "Verify utility orchestrates complete app data reset by clearing IndexedDB, localStorage, CacheStorage, and unregistering service workers with success flag tracking."
        },
        {
          "path": "frontend/src/hooks/queries/binanceFetch.ts",
          "operation": "modify",
          "description": "Verify browser-based fetching functions for Binance Futures USD-M API including market data and specific asset queries. Ensure error classification for network issues, CORS blocks, and restricted location responses works correctly."
        },
        {
          "path": "frontend/src/hooks/queries/institutionalOrders.ts",
          "operation": "modify",
          "description": "Verify detection of institutional trading signals from BTC market data using volume patterns and price action. Ensure React Query hooks for both Futures and Spot markets with backend fallback support function correctly."
        },
        {
          "path": "frontend/src/hooks/queries/orderBookDepth.ts",
          "operation": "modify",
          "description": "Verify React Query hooks fetch and parse order book depth data from Binance Futures and Spot APIs. Ensure error classification, aggregation, and metrics computation with backend fallback support work correctly."
        },
        {
          "path": "frontend/src/hooks/queries/analysisEnrichment.ts",
          "operation": "modify",
          "description": "Verify calculation of advanced technical analysis including trend strength, support/resistance zones, manipulation zones, and institutional order detection. Ensure learning engine integration optimizes confidence scores and generates descriptive tags based on Smart Money Concepts."
        },
        {
          "path": "frontend/src/lib/tradeRecommendation.ts",
          "operation": "modify",
          "description": "Verify trade recommendation computation of entry/exit/stop-loss levels based on all 6 modalities (scalping, swing, breakout, reversal, SMC, FVG) using only frontend-fetched Binance market data without backend calls."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Ensure all frontend Binance Futures USD-M data fetching remains intact including market data queries, order book depth analysis, funding rates, open interest metrics, and institutional order detection with proper error handling",
      "acceptanceCriteria": [
        "All Binance API calls in frontend execute successfully",
        "Technical analysis enrichment with trend strength, support/resistance zones, and manipulation zones functions correctly",
        "Order book depth data displays properly for both Futures and Spot markets",
        "Error states show appropriate messages for different failure types",
        "Learning engine integration records predictions and updates accuracy metrics"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/queries/binanceFetch.ts",
          "operation": "modify",
          "description": "Verify all Binance Futures USD-M API fetch functions remain intact with proper error classification for network issues, CORS blocks, and restricted location responses. Ensure market data queries and specific asset queries work correctly."
        },
        {
          "path": "frontend/src/hooks/queries/binanceFuturesMetrics.ts",
          "operation": "modify",
          "description": "Verify fetching of Binance Futures funding rates and open interest data with safe partial-failure handling. Ensure in-memory session-based metrics history storage for detecting changes over time works correctly."
        },
        {
          "path": "frontend/src/hooks/queries/orderBookDepth.ts",
          "operation": "modify",
          "description": "Verify order book depth data fetching from Binance Futures and Spot APIs with error classification, aggregation, and metrics computation. Ensure backend fallback support is preserved."
        },
        {
          "path": "frontend/src/hooks/queries/institutionalOrders.ts",
          "operation": "modify",
          "description": "Verify institutional order detection from BTC market data using volume patterns and price action. Ensure React Query hooks for both Futures and Spot markets with backend fallback work correctly."
        },
        {
          "path": "frontend/src/hooks/queries/analysisEnrichment.ts",
          "operation": "modify",
          "description": "Verify technical analysis enrichment calculates trend strength, support/resistance zones, manipulation zones, and institutional order detection correctly. Ensure learning engine integration optimizes confidence scores and generates Smart Money Concepts-based tags."
        },
        {
          "path": "frontend/src/hooks/queries/learningIntegration.ts",
          "operation": "modify",
          "description": "Verify learning engine integration records predictions and updates results based on market data. Ensure prioritization of favorite symbols with adjusted confidence thresholds works correctly."
        },
        {
          "path": "frontend/src/components/DataStatusIndicator.tsx",
          "operation": "modify",
          "description": "Verify fixed-position status indicator displays data freshness, errors, and fetching state correctly. Ensure alerts for stale data, blocked access, or connection issues with retry functionality and last update timestamps render properly."
        },
        {
          "path": "frontend/src/components/TabFetchErrorState.tsx",
          "operation": "modify",
          "description": "Verify error state component for tab content displays error details with special handling for PWA cache mismatches. Ensure reload button and user-friendly error messages with technical details in alerts work correctly."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Preserve all immutable frontend paths without modifications: useInternetIdentity.ts hook for authentication, useActor.ts for backend actor management, main.tsx application entry point, and all components in frontend/src/components/ui directory",
      "acceptanceCriteria": [
        "No changes made to useInternetIdentity.ts, useActor.ts, or main.tsx files",
        "UI components in frontend/src/components/ui remain untouched",
        "Internet Identity flow continues to work with existing implementation",
        "Actor creation and query invalidation logic remains unchanged"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useInternetIdentity.ts",
          "operation": "modify",
          "description": "Verify no changes are made to this file. Ensure React context and hook for Internet Identity authentication manages login/logout flows, identity persistence, and delegation validity checks with configurable AuthClient options correctly."
        },
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Verify no changes are made to this file. Ensure management of backend actor creation and caching using React Query, automatic recreation when Internet Identity changes, and invalidation of dependent queries work correctly. Use the authorization component to handle first-admin initialization automatically."
        },
        {
          "path": "frontend/src/main.tsx",
          "operation": "modify",
          "description": "Verify no changes are made to this file. Ensure React application entry point sets up QueryClient, InternetIdentityProvider, and renders root App component correctly."
        }
      ]
    }
  ]
}