{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Unify tab visual layout for Radar and Trading Opportunities",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Align Radar tab layout/spacing and primary Card styling with the common tab template (consistent container, theme-driven Card/backdrop, no extra padding or bespoke gradients).",
      "acceptanceCriteria": [
        "Radar tab no longer adds extra outer padding/margins that make it look visually different from other tabs (e.g., remove/adjust any redundant outer `p-4` wrappers when TabsContent already controls spacing).",
        "Radar tab has a single, consistent top-level container structure aligned with other tabs (Card-based header/section styling consistent with existing tab patterns).",
        "Visual elements (header block, filter block, list container) align with the app’s existing theme variables and common Card/backdrop treatment used elsewhere (no bespoke gradient treatment that makes Radar look like a different template)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TabPageCard.tsx",
          "operation": "create",
          "description": "Create a small shared, reusable tab-layout wrapper for consistent tab presentation (e.g., a primary Card container with theme-driven border/background/backdrop and an optional CardHeader). Use shadcn-ui Card/CardHeader/CardContent composition (do not edit ui components). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/RadarDashboard.tsx",
          "operation": "modify",
          "description": "Refactor RadarDashboard visual structure to match the established tab pattern: remove the extra outer padding wrappers, replace the bespoke header gradient Card styling with the same theme-driven Card/backdrop treatment used in other tabs, and wrap header/filters/list within a consistent primary Card-based container (using the new TabPageCard wrapper and shadcn-ui Card primitives). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update Opportunities tab header and primary container to use the common CardHeader/Card layout pattern while preserving existing tab switching and states.",
      "acceptanceCriteria": [
        "The Opportunities tab renders its main title/description inside a CardHeader/Card layout consistent with other tabs (instead of a standalone h1 block).",
        "The Opportunities tab’s top-level styling (borders/background/backdrop/shadow treatment) visually matches the common tab template used by MarketOverview/TopRecommendations.",
        "No regressions to existing Opportunities functionality: modality tabs still switch content correctly; loading/error/empty states still render."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Opportunities.tsx",
          "operation": "modify",
          "description": "Replace the standalone heading block with a Card-based header (CardHeader/CardTitle/CardDescription) and ensure the tab’s primary container uses the same theme-driven Card/backdrop styling as other tabs. Keep existing Tabs/TabsContent behavior and loading/error/empty handling intact, updating only layout/styling and container composition (using TabPageCard and shadcn-ui Card primitives). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}