{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add trade entry/exit points and stop loss calculation to Opportunities",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Display optimal buy point (entry price) for selected opportunities using existing frontend market data and technical analysis",
      "acceptanceCriteria": [
        "Selected opportunity shows a clearly labeled entry price",
        "Entry price is calculated using existing market data without any new backend calls",
        "Price is displayed in the OpportunityDetailsPanel component"
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/tradeRecommendation.ts",
          "operation": "modify",
          "description": "Extend the TradeRecommendation type to include an explicit entryPrice field. Update the computeTradeRecommendation function to calculate and return the optimal entry price based on current market price, technical analysis (support/resistance levels from enrichment data), and modality parameters. For scalping, use tighter entry logic near current price; for swing, use support/resistance zones from technical analysis."
        },
        {
          "path": "frontend/src/components/OpportunityDetailsPanel.tsx",
          "operation": "modify",
          "description": "Add a new section displaying the entry price from the trade recommendation. Show the entry price with clear labeling (e.g., 'Entry Point'), format it with appropriate decimal precision, and display it prominently near other trade metrics. Use existing UI patterns from the component (cards, badges, or highlighted text) to ensure visual consistency."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Display take profit target (sell point) for selected opportunities based on volatility, momentum, and technical indicators from frontend analysis",
      "acceptanceCriteria": [
        "Take profit target is shown alongside the entry point",
        "Calculation uses only data already fetched from Binance in the frontend",
        "Target price reflects the opportunity type (scalping vs swing)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/tradeRecommendation.ts",
          "operation": "modify",
          "description": "Enhance the take profit (TP) calculation in computeTradeRecommendation to use volatility metrics from technical analysis (ATR, Bollinger Bands), momentum indicators (RSI, MACD from enrichment data), and modality-specific targets. For scalping opportunities, apply shorter TP targets (e.g., 0.5-1% moves); for swing opportunities, use wider targets (e.g., 2-5% moves) based on resistance levels and volatility. Ensure the calculation respects the opportunity's risk profile and current market conditions."
        },
        {
          "path": "frontend/src/components/OpportunityDetailsPanel.tsx",
          "operation": "modify",
          "description": "Add a take profit display section alongside the entry price. Show the TP target with clear labeling (e.g., 'Take Profit Target'), include the potential gain percentage, and use visual indicators (e.g., green badges or highlighted text) to emphasize the profit target. Ensure the display adapts to the opportunity type (scalping vs swing) with appropriate context."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Calculate and display stop loss price using ATR, support levels, and percentage-based risk management from frontend technical analysis",
      "acceptanceCriteria": [
        "Stop loss price is clearly displayed in the details panel",
        "Calculation respects the opportunity's risk profile",
        "No new data sources are introduced; uses existing Binance data from frontend"
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/tradeRecommendation.ts",
          "operation": "modify",
          "description": "Refine the stop loss (SL) calculation in computeTradeRecommendation to incorporate ATR-based stops (e.g., 1.5x ATR below entry), support level detection from technical analysis enrichment, and percentage-based fallback logic (e.g., 2% for scalping, 5% for swing). Apply risk management rules that adjust SL based on volatility context, opportunity confidence score, and modality parameters. Ensure the SL price is always below the entry for long positions and above for short positions."
        },
        {
          "path": "frontend/src/components/OpportunityDetailsPanel.tsx",
          "operation": "modify",
          "description": "Add a stop loss display section in the details panel. Show the SL price with clear labeling (e.g., 'Stop Loss'), include the potential loss percentage, and use visual indicators (e.g., red badges or warning-styled text) to emphasize risk. Display the risk-reward ratio (TP gain vs SL loss) to provide context for the trade setup. Ensure consistency with existing UI patterns for trade metrics."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Ensure all entry/exit/stop loss calculations use only frontend-fetched Binance data without introducing new backend HTTP calls",
      "acceptanceCriteria": [
        "No new HTTP outcalls to Binance are added to backend code",
        "All calculations occur in frontend using existing market data hooks",
        "Backend remains unchanged and continues only CoinGecko integration"
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/tradeRecommendation.ts",
          "operation": "modify",
          "description": "Verify that all entry, TP, and SL calculations in computeTradeRecommendation rely exclusively on parameters passed from frontend hooks (market data, technical analysis from analysisEnrichment, modality config). Do not add any new data fetching logic or backend calls. Document in code comments that all required data (price, volume, ATR, support/resistance, momentum indicators) must be provided by the caller from existing Binance frontend hooks (binanceFetch, analysisEnrichment)."
        },
        {
          "path": "frontend/src/hooks/useTradeRecommendation.ts",
          "operation": "modify",
          "description": "Ensure the useTradeRecommendation hook passes complete technical analysis data (including ATR, support/resistance, momentum indicators) from the enriched analysis to computeTradeRecommendation. Verify that all data originates from existing Binance market data hooks (useBinanceFuturesQuery, useEnrichedAnalysis) and no new data sources are introduced. Add inline comments confirming the data flow and sources."
        },
        {
          "path": "frontend/src/hooks/queries/analysisEnrichment.ts",
          "operation": "modify",
          "description": "Review and ensure the enrichAnalysis function provides all necessary technical indicators (ATR, support/resistance levels, momentum signals) required for entry/exit/SL calculations. Verify that all data comes from the ticker parameter (sourced from Binance) and internal calculations. Add or expose any missing metrics (e.g., explicit support/resistance levels, ATR values) that are needed by tradeRecommendation logic."
        }
      ]
    }
  ]
}