{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Trade recommendations in Opportunities details (Long/Short + Entry/TP/SL by modality)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Enable selecting an opportunity from any modality tab and opening a closable details side panel for the chosen symbol without losing the active tab.",
      "acceptanceCriteria": [
        "From any Opportunities tab (scalping/swing/breakout/reversal/smc/fvg), clicking an opportunity card opens a dedicated details UI for that symbol.",
        "The details UI shows, at minimum, the symbol and current price (using the existing opportunity data).",
        "The user can close the details UI and return to the Opportunities list without losing the currently selected modality tab."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Opportunities.tsx",
          "operation": "modify",
          "description": "Convert Opportunities tabs to a controlled value (preserve active modality), add selection state (selectedSymbol + selectedModality), wire opportunity card clicks to open a details side panel, and wire close behavior to keep the current tab selection. Compose existing shadcn-ui primitives already used on the page (e.g., Card/Badge/ScrollArea/Tabs) rather than editing files under frontend/src/components/ui. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/OpportunityDetailsPanel.tsx",
          "operation": "create",
          "description": "Create a dedicated details UI component rendered as a side panel (responsive overlay on small screens) showing at minimum: symbol and current price from the selected OpportunityItem / current market data. Compose existing shadcn-ui primitives (Card, Badge, ScrollArea where helpful) rather than editing frontend/src/components/ui. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Compute and display a deterministic trade recommendation (Long/Short + Entry/TP/SL) for the selected symbol, influenced by the active Opportunities modality and derived from existing live market + analysis data with graceful fallback.",
      "acceptanceCriteria": [
        "When an opportunity is selected, the details UI shows a clearly labeled “Trade Recommendation” section.",
        "The “Trade Recommendation” section shows: Direction (Long/Short), Entry, Take Profit, Stop Loss.",
        "The recommendation changes when the user changes the modality tab and selects an asset within that modality (i.e., modality influences the output).",
        "Entry/TP/SL values are computed deterministically from currently available app data for that symbol (no hardcoded per-symbol values).",
        "If required analysis inputs for a symbol are unavailable, the UI shows a graceful fallback state explaining the recommendation cannot be computed right now (without crashing the Opportunities page)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/tradeRecommendation.ts",
          "operation": "create",
          "description": "Implement a deterministic trade recommendation engine that accepts (modality, current price, technical analysis data already computed in the app such as trend/confidence/supportZones/resistanceZones/manipulationZones/institutionalOrders) and returns Direction (Long/Short), Entry, Take Profit, Stop Loss, plus a typed error/fallback reason when inputs are insufficient. Ensure modality changes risk/target sizing rules while avoiding any hardcoded per-symbol values."
        },
        {
          "path": "frontend/src/hooks/useTradeRecommendation.ts",
          "operation": "create",
          "description": "Create a hook that derives the selected symbol’s enriched market+analysis object from existing live data (via existing queries/hooks) and calls the deterministic recommendation engine. Expose loading/ready/fallback states suitable for rendering in the Opportunities details panel."
        },
        {
          "path": "frontend/src/components/OpportunityDetailsPanel.tsx",
          "operation": "modify",
          "description": "Add a clearly labeled “Trade Recommendation” section showing Direction (Long/Short), Entry, Take Profit, Stop Loss using the new hook. Render a graceful fallback state (non-crashing) when recommendation inputs are missing. Compose existing shadcn-ui primitives (Card/Badge) rather than editing frontend/src/components/ui. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/Opportunities.tsx",
          "operation": "modify",
          "description": "Pass the active modality and selected symbol/opportunity into OpportunityDetailsPanel so the recommendation output is modality-aware and updates when the user selects assets from different modality tabs (without introducing new routes). Compose existing shadcn-ui primitives rather than editing frontend/src/components/ui. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Display transparent recommendation rationale by reusing existing computed signals (trend, confidence, support/resistance references, institutional/manipulation tags) with no new external APIs.",
      "acceptanceCriteria": [
        "The recommendation UI displays a short list of “Rationale” or “Signals” that references existing computed indicators (e.g., trend/confidence/nearest support-resistance, or existing reasons/tags already computed by the app).",
        "Rationale content updates together with the recommendation for the selected symbol/modality.",
        "No new external APIs are introduced for rationale generation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/tradeRecommendation.ts",
          "operation": "modify",
          "description": "Extend the recommendation result to include justification metadata (e.g., selected trend/confidence level, nearest support/resistance references used in level selection, and any existing institutional/manipulation/tag signals considered) derived only from the existing analysis inputs."
        },
        {
          "path": "frontend/src/components/OpportunityDetailsPanel.tsx",
          "operation": "modify",
          "description": "Render a “Rationale”/“Signals” list in the recommendation UI using the justification metadata and existing opportunity reasons/tags from current app data. Ensure it updates alongside the recommendation when symbol/modality changes. Compose existing shadcn-ui primitives (Badge/ScrollArea/Card) rather than editing frontend/src/components/ui. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}